class Regions:
    _rows = [
        {
            "name": "Абыйский район",
            "regions": [
                {"name": "Муниципальный район «Абыйский улус (район)»"},
                {"name": "«Майорский национальный наслег» Абыйского улуса (района)"},
                {"name": "МО «Поселок Белая Гора» Абыйского улуса (района)"},
                {"name": "МО «Мугурдахский наслег» Абыйского района"},
                {"name": "МО сельское поселение «Уолбутский наслег» Абыйского улуса (района)"},
                {"name": "МО «Урасалахский наслег» Абыйского улуса (района)"},
                {"name": "МО «Абыйский наслег» Абыйского улуса (района) Республики Саха(Якутия)"}
            ]
        },
        {
            "name": "Алданский район",
            "regions": [
                {"name": "МО «Алданский район»"},
                {"name": "МО «Беллетский эвенкийский национальный наслег» Алданского района"},
                {"name": "МО «поселок Ленинский» Алданского района"},
                {"name": "МО «Поселок Нижний Куранах» Алданского района"},
                {"name": "МО «Чагдинский наслег» Алданского района"},
                {"name": "МО «Национальный наслег Анамы» Алданского района"},
                {"name": "МО «Город Алдан» Алданского улуса (района)"},
                {"name": "МО «Город Томмот» Алданского района"}
            ]
        },
        {
            "name": "Аллаиховский район",
            "regions": [
                {"name": "муниципальный район «Аллаиховский улус (район)»"},
                {"name": "МО «Поселок Чокурдах» Аллаиховского улуса (района)"},
                {"name": "МО «Быягнырский наслег» Аллаиховского улуса (района)"},
                {"name": "МО «Юкагирский национальный наслег» села Оленегорск Аллайховского улуса (района)"},
                {"name": "МО сельское поселение «Береляхский наслег» Аллаиховского (района)"},
                {"name": "«Русско-Устьинский наслег» Аллайховского улуса (района)"}
            ]
        },
        {
            "name": "Анабарский район",
            "regions": [
                {"name": "МО «Анабарский национальный (долгано-эвенкийский) улус (район)»"},
                {"name": "МО «Саскылахский национальный (эвенкийский) наслег» Анабарского национального (долгано-эвенкийского) улуса (района)"},
                {"name": "МО «Юрюнг-Хаинский национальный (долганский) наслег» Анабарского национального (долгано-эвенкийского) улуса (района)"}
            ]
        },
        {
            "name": "Амгинский район",
            "regions": [
                {"name": "муниципальный район «Амгинский улус (район)»"},
                {"name": "МО «Сулгачинский наслег» Амгинского улуса (района)"},
                {"name": "МО «Амгино-Нахаринский наслег» Амгинского улуса (района)"},
                {"name": "МО «Эмисский наслег» Амгинского улуса (района)»"},
                {"name": "МО «Бетюнский наслег» Амгинского улуса (района)"},
                {"name": "МО «Майский наслег» Амгинского улуса (района)"},
                {"name": "МО «Соморсунский наслег» Амгинского улуса (района)"},
                {"name": "МО «Чапчылганский наслег» Амгинского улуса (района)"},
                {"name": "МО «Болугурский наслег» Амгинского улуса (района)"},
                {"name": "МО «Алтанский наслег» Амгинского улуса (района)"},
                {"name": "МО «Чакырский наслег» Амгинского улуса (района)"},
                {"name": "МО «Мяндигинский наслег» Амгинского улуса (района)"},
                {"name": "МО «Абагинский наслег» Амгинского улуса (района)"},
                {"name": "МО «Амгинский наслег» Амгинского улуса (района)"},
                {"name": "МО «Сатагайский наслег» Амгинского улуса (района) Республики Саха(Якутия)"}
            ]
        },
        {
            "name": "Булунский район",
            "regions": [
                {"name": "МО «Булунский улус (район)»"},
                {"name": "сельское поселение «Булунский национальный (эвенкийский) наслег» Булунского улуса (района)"},
                {"name": "сельское поселение «Тюметинский национальный (эвенкийский) наслег» Булунского улуса (района)"},
                {"name": "МО «Хара-Улахский национальный наслег» Булунского улуса (района)"},
                {"name": "Сельское поселение «Борогонский наслег» Булунского улуса (района)"},
                {"name": "Сельское поселение «Сиктяхский наслег» Булунского улуса (района)"},
                {"name": "Сельское поселение «Быковский национальный (эвенкийский) наслег» Булунского улуса (района)"},
                {"name": "МО «Поселок Тикси» Булунского улуса (района)"}
            ]
        },
        {
            "name": "Верхневилюйский район",
            "regions": [
                {"name": "Муниципальный район «Верхневилюйский улус (район)»"},
                {"name": "МО «Ботулунский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Кэнтикский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Едюгейский наслег» Верхневилюйского улуса (района)"},
                {"name": "сельское поселение «Туобуйинский наслег» муниципального района «Верхневилюйский улус (район)»"},
                {"name": "МО «Дюллюкинский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Онхойский наслег» Верхневилюйского улуса (района)"},
                {"name": "сельское поселение «Сургулукский наслег» муниципального района «Верхневилюйский улус (район)»"},
                {"name": "МО «село Верхневилюйск» Верхневилюйского улуса (района)"},
                {"name": "МО «Хоринский наслег» Верхневилюйского улуса (района)"},
                {"name": "«Далырский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Тамалаканский наслег»Верхневилюйского улуса (района)"},
                {"name": "«Оросунский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Магасский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Хомустахский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Балаганнахский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Быраканский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Мэйикский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Намский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Кырыкыйский наслег» Верхневилюйского улуса (района)"},
                {"name": "«Харбалахский наслег» Верхневилюйского улуса (района)"},
                {"name": "МО «Оргетский наслег» Верхневилюйского улуса (района)"}
            ]
        },
        {
            "name": "Верхнеколымский район",
            "regions": [
                {"name": "Муниципальный район «Верхнеколымский улус (район)»"},
                {"name": "МО «Верхнеколымский наслег Верхнеколымского улуса (района)"},
                {"name": "МО «Поселок Зырянка» Верхнеколымского улуса (района)"},
                {"name": "МО «Утаинский эвенский национальный наслег» Верхнеколымского улуса (района)"},
                {"name": "МО «Угольнинский наслег» Верхнеколымского улуса (района)"},
                {"name": "Суктул «Нелемнский юкагирский наслег» Верхнеколымского улуса (района)"},
                {"name": "МО «Арылахский наслег» Верхнеколымского улуса (района)"}
            ]
        },
        {
            "name": "Верхоянский район",
            "regions": [
                {"name": "МО «Верхоянский район»"},
                {"name": "МО «Эгинский наслег» Верхоянского района Республики Саха(Якутия)"},
                {"name": "МО «Янский наслег» Верхоянского района Республики Саха(Якутия)"},
                {"name": "МО «Дулгалахский наслег» Верхоянского района"},
                {"name": "МО «Бабушкинский наслег» Верхоянского района"},
                {"name": "МО «Арылахский наслег» Верхоянского района"},
                {"name": "МО «Суордахский наслег» Верхоянский район"},
                {"name": "МО «Поселок Эсе-Хайя» Верхоянского района"},
                {"name": "МО «Табалахский наслег» Верхоянского района"},
                {"name": "МО «Барыласский наслег» Верхоянского района"},
                {"name": "МО «Эльгесский наслег» Верхоянского района"},
                {"name": "МО «Черюмчинский наслег» Верхоянского района"},
                {"name": "МО «Борулахский наслег» Верхоянского района"},
                {"name": "МО «Адычинский наслег» Верхоянского района"},
                {"name": "МО «Столбинский наслег» Верхоянского района"},
                {"name": "МО «Сартанский наслег» Верхоянского района"},
                {"name": "МО «Поселок Батагай» Верхоянского района"},
                {"name": "МО «Город Верхоянск» Верхоянского района"}
            ]
        },
        {
            "name": "Вилюйский район",
            "regions": [
                {"name": "Муниципальный район «Вилюйский улус (район)»"},
                {"name": "МО «Кыргыдайский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Тасагарский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Жемконский наслег» Вилюйского улуса (района) РС (Я)"},
                {"name": "МО «Халбакинский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Тылгынинский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Кюлетский 2-й наслег» Вилюйского улуса (района)"},
                {"name": "МО (сельское поселение) «Хагынский наслег» муниципального района «Вилюйский улус (район)»"},
                {"name": "МО «Кюлетский 1-й наслег» Вилюйского улуса (района)"},
                {"name": "МО «Бекчегинский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Лекеченский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Баппагайинский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Первый Тогусский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Чочунский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Чернышевский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Тогусский наслег» Вилюйского улуса (района) (Республики Саха (Якутия)"},
                {"name": "МО «Борогонский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Арылахский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Екюндюнский наслег» Вилюйского улуса (района)"},
                {"name": "МО «Город Вилюйск» Вилюйского улуса (района)"},
                {"name": "МО «поселок Кысыл-Сыр» Вилюйского улуса (района)"},
                {"name": "МО «Югюлятский наслег» Вилюйского улуса (района)"}
            ]
        },
        {
            "name": "Горный район",
            "regions": [
                {"name": "Муниципальный район «Горный улус»"},
                {"name": "«Атамайский наслег» Горного улуса"},
                {"name": "МО «Бердигестяхский наслег» Горного улуса"},
                {"name": "МО «Октябрьский наслег» Горного улуса"},
                {"name": "МО «Кировский наслег» Горного улуса"},
                {"name": "МО «Шологонский наслег» Горного улуса (района)"},
                {"name": "МО «Маганинский наслег» Горного улуса"},
                {"name": "МО «Мытахский наслег» Горного улуса (района)"},
                {"name": "МО «Одунунский наслег» Горного улуса"},
                {"name": "МО «Малтанинский наслег» Горного улуса (района)"}
            ]
        },
        {
            "name": "Жиганский район",
            "regions": [
                {"name": "Муниципальный район «Жиганский национальный эвенкийский район»"},
                {"name": "МО «Жиганский эвенкийский национальный наслег» муниципального района «Жиганский национальный эвенкийский район»"},
                {"name": "МО «Линдинский эвенкийский национальный наслег» Жиганского национального эвенкийского района"},
                {"name": "МО «Бестяхский наслег» Жиганского улуса (района)"},
                {"name": "Эвенкийское МО «Кыстатыам» муниципального района «Жиганский национальный эвенкийский район» Республики Саха(Якутия)"}
            ]
        },
        {
            "name": "Кобяйский район",
            "regions": [
                {"name": "МО «Кобяйский улус (район)»"},
                {"name": "МО «Ситтинский наслег» Кобяйского улуса (района)"},
                {"name": "МО «Кобяйский наслег» Кобяйского улуса (района)"},
                {"name": "МО «Поселок Сангар» Кобяйского улуса (района)"},
                {"name": "МО «Люччегинский 1-й наслег» Кобяйского улуса (района)"},
                {"name": "МО «Мукучунский наслег» Кобяйского улуса (района) Республики Саха(Якутия)"},
                {"name": "МО «Кировский эвенский национальный наслег» Кобяйского улуса (района)"},
                {"name": "МО «Люччегинский 2-й наслег» Кобяйского улуса"},
                {"name": "МО «Ламынхинский национальный наслег» Кобяйского улуса (района) (Республики Саха (Якутия)"},
                {"name": "МО «Нижилинский наслег» Кобяйского улуса (района)"},
                {"name": "МО «Куокуйский наслег» Кобяйского улуса (района)"},
                {"name": "«Арыктахский наслег» Кобяйского улуса (района)"},
                {"name": "МО «Тыайинский наслег» Кобяйского улуса (района)"}
            ]
        },
        {
            "name": "Ленский район",
            "regions": [
                {"name": "МО «Ленский район»"},
                {"name": "МО «Орто-Нахаринский наслег» Ленского района"},
                {"name": "МО «Ярославский наслег» Ленского района"},
                {"name": "МО «Толонский наслег» Ленского района"},
                {"name": "МО «Посёлок Пеледуй» Ленского района"},
                {"name": "МО «Наторинский наслег» Ленского района"},
                {"name": "МО «Посёлок Витим» Ленского района"},
                {"name": "МО «Город Ленск» Ленского района"},
                {"name": "МО «Мурбайский наслег» Ленского района"},
                {"name": "МО «Салдыкельский наслег» Ленского района"},
                {"name": "МО «Беченчинский наслег» Ленского района"},
                {"name": "МО «Нюйский наслег» Ленского района"}
            ]
        },
        {
            "name": "Мегино-Кангаласский район",
            "regions": [
                {"name": "муниципальный район «Мегино-Кангаласский улус»"},
                {"name": "МО «Село Майя»муниципального района «Мегино-Кангаласский улус»"},
                {"name": "МО «поселок Нижний Бестях» муниципального района «Мегино-Кангаласский улус»"},
                {"name": "МО «Батаринский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Мегинский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Морукский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Нахаринский 2-й наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «село Бедимя» Мегино-Кангаласского улуса (района) "},
                {"name": "МО «Алтанский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Рассолодинский наслег» Мегино-Кангаласского улуса"},
                {"name": "МО «Арангасский наслег» Мегино - Кангаласского улуса (района)"},
                {"name": "МО «Догдогинский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Тыллыминский 1-й наслег» МР «Мегино-Кангаласский улус»"},
                {"name": "МО «Тюнгюлюнский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Мельжехсинский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Мегюренский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Томторский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Ходоринский наслег» муниципального района «Мегино-Кангаласский улус»"},
                {"name": "МО «Бютейдяхский наслег» муниципального района «Мегино-Кангаласский улус»"},
                {"name": "МО «Доллунский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Нахаринский 1-ый наслег» муниципального района «Мегино-Кангаласский улус»"},
                {"name": "МО «Хаптагайский наслег» муниципального района «Мегино-Кангаласский улус»"},
                {"name": "МО «Жабыльский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Нерюктяйинский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Тарагайский наслег» Мегино-Кангаласского (района)"},
                {"name": "МО «Харанский наслег» муниципального района «Мегино-Кангаласский улус»"},
                {"name": "МО «Жанхадинский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Хоробутский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Дойдунский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Тыллыминский 2-й наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Холгуминский наслег» Мегино-Кангаласского улуса (района)"},
                {"name": "МО «Чыамайыкинский наслег» Мегино-Кангаласского улуса (района)"}
            ]
        },
        {
            "name": "Мирнинский район",
            "regions": [
                {"name": "МО «Мирнинский район»"},
                {"name": "МО «Город Мирный» Мирнинского района"},
                {"name": "МО «Поселок Айхал» Мирнинского района"},
                {"name": "МО «Поселок Алмазный» Мирнинского района"},
                {"name": "МО «Город Удачный» Мирнинского района"},
                {"name": "МО «Посёлок Чернышевский» Мирнинского района"},
                {"name": "МО «Ботуобуйинский наслег» Мирнинского района Республики Саха(Якутия)"},
                {"name": "МО «Садынский национальный эвенкийский наслег» Мирнинского района"},
                {"name": "МО «Чуонинский наслег» Мирнинского района Республики Саха(Якутия)"},
                {"name": "МО «Поселок Светлый» Мирнинского района"}
            ]
        },
        {
            "name": "Момский район",
            "regions": [
                {"name": "МО «Момский район»"},
                {"name": "МО «Тебюляхский национальный наслег» Момского района"},
                {"name": "МО «Улахан-Чистайский национальный наслег» Момского улуса (района)"},
                {"name": "МО «Чыбагалахский национальный наслег» Момского района"},
                {"name": "МО «Соболохский национальный наслег» Момского улуса (района)"},
                {"name": "МО «Момский национальный наслег» Момского района"},
                {"name": "МО «Индигирский национальный наслег» Момского улуса (района)"}
            ]
        },
        {
            "name": "Намский район",
            "regions": [
                {"name": "МО «Намский улус»"},
                {"name": "МО «Хатырыкский наслег» Намского улуса (района)"},
                {"name": "МО «Маймагинский наслег» Намского улуса (района)"},
                {"name": "МО «Тастахский наслег» Намского улуса (района)"},
                {"name": "МО «Хомустахский 1-й наслег» Намского улуса (района)"},
                {"name": "МО «Никольский наслег» Намского улуса (района)"},
                {"name": "МО «Хатын-Арынский наслег» Намского улуса"},
                {"name": "МО «Тюбинский наслег» Намского улуса"},
                {"name": "МО «Партизанский наслег» Намского улуса (района)"},
                {"name": "МО «Арбынский наслег» Намского улуса (района)"},
                {"name": "МО «Салбанский наслег» Намского улуса (района)"},
                {"name": "«Модутский наслег» Намского улуса (района)"},
                {"name": "МО «Хамагаттинский наслег» Намского улуса (района)"},
                {"name": "МО «Ленский наслег»"},
                {"name": "МО «Едейский наслег» Намского улуса (района)"},
                {"name": "МО «Хомустахский 2-й наслег» Намского улуса (района)"},
                {"name": "МО «Бетюнский наслег» Намского улуса (района)"},
                {"name": "МО «Искровский наслег» Намского улуса (района) Республики Саха(Якутия)"},
                {"name": "МО «Фрунзенский наслег» Намского улуса (района) Республики Саха(Якутия)"},
                {"name": "МО «Кебекенский наслег» Намского улуса (района)"}
            ]
        },
        {
            "name": "Нерюнгринский район",
            "regions": [
                {"name": "МО «Нерюнгринский район»"},
                {"name": "МО «Город Нерюнгри» Нерюнгринского района"},
                {"name": "МО «Городское поселение «Поселок Хани» Нерюнгринского района"},
                {"name": "Городское поселение «Поселок Беркакит» Нерюнгринского района"},
                {"name": "«городское поселение «Поселок Золотинка» Нерюнгринского района»"},
                {"name": "городское поселение «Поселок Серебряный Бор» Нерюнгринского района"},
                {"name": "сельское поселение «Иенгринский эвенкийский национальный наслег» Нерюнгринского района"},
                {"name": "Городское поселение «Поселок Чульман» Нерюнгринского района"}
            ]
        },
        {
            "name": "Нижнеколымский район",
            "regions": [
                {"name": "Муниципальный район «Нижнеколымский район»"},
                {"name": "МО «поселок Черский»"},
                {"name": "национальное юкагирское МО «Олеринский Суктул» Нижнеколымского района"},
                {"name": "МО «Чукотский национальный Халарчинский наслег» Нижнеколымского района"},
                {"name": "МО «Походский наслег» Нижнеколымского улуса (района)"}
            ]
        },
        {
            "name": "Нюрбинский район",
            "regions": [
                {"name": "муниципальный район «Нюрбинский район»"},
                {"name": "МО «Таркайинский наслег» Нюрбинского района"},
                {"name": "«Бордонский наслег» Нюрбинского улуса (района)"},
                {"name": "МО «Город Нюрба» муниципального района «Нюрбинский район»"},
                {"name": "МО «Мальжагарский наслег» Нюрбинского района"},
                {"name": "«Жарханский наслег» Нюрбинского района"},
                {"name": "МО «Чукарский наслег» Нюрбинского улуса (района)"},
                {"name": "МО «Чаппангдинский наслег» Нюрбинского района"},
                {"name": "МО «Мархинский наслег» Нюрбинского района"},
                {"name": "МО сельское поселение «Кюндядинский наслег» муниципального района «Нюрбинский район»"},
                {"name": "МО «Мегежекский наслег» Нюрбинского района"},
                {"name": "МО «Сюлинский наслег» Нюрбинского улуса (района)"},
                {"name": "МО «Аканинский наслег» Нюрбинского района"},
                {"name": "МО «Хорулинский наслег» Нюрбинского улуса (района)"},
                {"name": "сельское поселение «Едейский наслег» муниципального района «Нюрбинский район»"},
                {"name": "МО «Нюрбачанский наслег» Нюрбинского района"},
                {"name": "сельское поселение «Дикимдинский наслег» муниципального района «Нюрбинский район»"},
                {"name": "МО «Октябрьский наслег» Нюрбинского района"},
                {"name": "МО «Кангаласский наслег» Нюрбинского района"},
                {"name": "МО «Тюмюкский наслег» Нюрбинского района"}
            ]
        },
        {
            "name": "Оймяконский район",
            "regions": [
                {"name": "МО «Оймяконский улус (район)»"},
                {"name": "МО «поселок Артык» Оймяконского улуса (района)"},
                {"name": "МО «Поселок Усть-Нера» Оймяконского улуса (района)"},
                {"name": "сельское поселение «Оймякон Полюс Холода» муниципального района «Оймяконский улус (район)»"},
                {"name": "МО «Сордоннохский наслег» Оймяконского улуса(района)"},
                {"name": "МО «Ючюгейский наслег» Оймяконского улуса (района)"},
                {"name": "МО «Терютский наслег» Оймяконского улуса  (района)"},
                {"name": "МО «Борогонский 2-й наслег» Оймяконского улуса (района)"}
            ]
        },
        {
            "name": "Олекминский район",
            "regions": [
                {"name": "Муниципальный район «Олекминский район»"},
                {"name": "МО «Жарханский национальный наслег» Олекминского района"},
                {"name": "МО «Кыллахский наслег» Олекминского района"},
                {"name": "МО «Поселок Заречный» Олекминского района"},
                {"name": "МО «Саныяхтахский наслег» Олекминского района"},
                {"name": "МО «Троицкий наслег» Олекминского района"},
                {"name": "МО «Дельгейский наслег» Олекминского района"},
                {"name": "МО «Чапаевский наслег» Олекминского района"},
                {"name": "МО «Кяччинский наслег» Олекминского района"},
                {"name": "МО « Тянский национальный наслег» Олекминского района"},
                {"name": "МО «Нерюктяйинский 1-й наслег» Олекминского района"},
                {"name": "МО «Дабанский наслег» Олекминского района"},
                {"name": "МО «Олекминский наслег»» Олекминского района"},
                {"name": "МО «Урицкий наслег» Олекминского района"},
                {"name": "МО «Чаринский национальный наслег» Олекминского района"},
                {"name": "МО «Улахан-Мунгкунский наслег» Олекминского района"},
                {"name": "МО «Мачинский наслег» Олекминского района"},
                {"name": "МО «Хоринский наслег» Олекминского района"},
                {"name": "МО «Абагинский наслег» Олекминского района"},
                {"name": "МО «Солянский наслег» Олекминского района"},
                {"name": "МО «Мальжагарский наслег» Олекминского района"},
                {"name": "МО «Киндигирский национальный наслег» Олекминского района"},
                {"name": "МО «Нерюктяйинский 2-й наслег» Олекминского района"},
                {"name": "МО «Город Олекминск» Олекминского района"}
            ]
        },
        {
            "name": "Оленекский район",
            "regions": [
                {"name": "Муниципальный район «Оленекский эвенкийский национальный район»"},
                {"name": "«Кирбейский национальный наслег» муниципального района «Оленекский эвенкийский национальный район»"},
                {"name": "МО «Оленекский национальный наслег» Оленекского эвенкийского национального района"},
                {"name": "МО «Шологонский национальный наслег» Оленекского улуса (района)"},
                {"name": "МО «Жилиндинский национальный наслег» Оленекского эвенкийского национального улуса (района)"}
            ]
        },
        {
            "name": "Среднеколымский район",
            "regions": [
                {"name": "МО «Среднеколымский улус (район)»"},
                {"name": "МО «Хатынгнахский наслег» Среднеколымского улуса (района)"},
                {"name": "«Сень-Кюельский наслег» Среднеколымского улуса (района)"},
                {"name": "МО «Мятисский 1-й наслег» Среднеколымского улуса (района)"},
                {"name": "МО «Мятисский 2-й наслег» Среднеколымского улуса (района)"},
                {"name": "МО «Березовский национальный (кочевой) наслег» Среднеколымского улуса (района)"},
                {"name": "МО «Кангаласский 1-й наслег» Среднеколымского улуса (района)"},
                {"name": "МО «Кангаласский 2-й наслег» Среднеколымского улуса (района)"},
                {"name": "МО «Алазейский наслег» Среднеколымского улуса (района)"},
                {"name": "МО «Город Среднеколымск» Среднеколымского улуса (района)"},
                {"name": "«Байдинский наслег» Среднеколымского улуса (района)"}
            ]
        },
        {
            "name": "Сунтарский район",
            "regions": [
                {"name": "Муниципальный район «Сунтарский улус (район)»"},
                {"name": "муниципального образования «Крестяхский наслег» Сунтарского улуса (района)"},
                {"name": "МО «Куокунинский наслег» муниципального района «Сунтарский улус (район)»"},
                {"name": "«Хоринский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Кюкяйский наслег» муниципального района «Сунтарский улус (район)»"},
                {"name": "МО «Сунтарский наслег» Сунтарского улуса (района)"},
                {"name": "сельского поселения «Хаданский наслег» Сунтарского улуса (района)»"},
                {"name": "МО «Тюбяй-Жарханский наслег» муниципального района «Сунтарский улус (район)» Республики Саха(Якутия)"},
                {"name": "сельское поселение «Туойдахский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Толонский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Аллагинский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Вилючанский наслег» муниципального района «Сунтарский улус (район)»"},
                {"name": "муниципального образования «Тойбохойский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Мар - Кюельский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Кемпендяйский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Илимнирский наслег» муниципального района «Сунтарский улус (район)»"},
                {"name": "Сельское поселения «Жарханский наслег» муниципального района «Сунтарский улус (район)»"},
                {"name": "«Устьинский наслег» муниципального района «Сунтарский улус (район)»"},
                {"name": "сельское поселение «Кюндяйинский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Эльгяйский наслег» МР «Сунтарский улус (район)»"},
                {"name": "МО «Бордонский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Кутанинский наслег» муниципального района «Сунтарский улус (район)»"},
                {"name": "Сельское поселение «Шеинский наслег» муниципального района «Сунтарский улус»"},
                {"name": "сельское поселение «Арылахский наслег» Сунтарского улуса (района)"},
                {"name": "МО «Тюбяйский наслег» Сунтарского улуса (района)"},
                {"name": "«Нахаринский наслег» Сунтарского улуса (района)"},
                {"name": "сельское поселение «Тенкинский наслег» муниципального района «Сунтарский улус (район)»"}
            ]
        },
        {
            "name": "Таттинский район",
            "regions": [
                {"name": "Муниципальный район «Таттинский улус»"},
                {"name": "«Октябрьский наслег» Таттинского улуса (района)"},
                {"name": "МО «Игидейский наслег» Таттинского улуса"},
                {"name": "МО «Дайа-Амгинский наслег» Таттинского улуса (района)"},
                {"name": "МО «Хара-Алданский наслег» Таттинского улуса (района)"},
                {"name": "МО «Уолбинский наслег» Таттинского улуса (района)"},
                {"name": "МО «Жохсогонский наслег» Таттинского улуса (района)"},
                {"name": "МО «Алданский наслег» Таттинского улуса"},
                {"name": "МО «Баягинский наслег» Таттинского улуса (района)"},
                {"name": "МО «Таттинский наслег» Таттинского улуса (района)"},
                {"name": "«Усть-Амгинский наслег» Таттинского улуса (района)"},
                {"name": "МО «Жулейский наслег» Таттинского улуса (района)"},
                {"name": "МО «Тыарасинский наслег» Таттинского улуса (района)"},
                {"name": "МО «Средне-Амгинский наслег» Таттинского улуса (района)"},
                {"name": "сельское поселение «Амгинский наслег» муниципального района «Таттинский улус»"}
            ]
        },
        {
            "name": "Томпонский район",
            "regions": [
                {"name": "Муниципальный район «Томпонский район»"},
                {"name": "МО «Баягантайский наслег» Томпонского района"},
                {"name": "МО «Поселок Хандыга» Томпонского района"},
                {"name": "МО «Ынгинский наслег» Томпонского района"},
                {"name": "МО «Охот-Перевозовский наслег» Томпонского района"},
                {"name": "МО «Сасыльский наслег» Томпонского улуса (района)"},
                {"name": "МО «Теплоключевской наслег»Томпонского района "},
                {"name": "МО «Поселок Джебарики-Хая» Томпонского улуса (района)"},
                {"name": "«Мегино-Алданский наслег» Томпонского района"},
                {"name": "МО «Томпонский национальный (эвенский) наслег» Томпонского района"}
            ]
        },
        {
            "name": "Усть-Алданский район",
            "regions": [
                {"name": "Муниципальный район «Усть-Алданский улус (район)»"},
                {"name": "«Наяхинский наслег» Усть-Алданского улуса (района)"},
                {"name": "«Суоттунский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Дюпсюнский наслег» Усть-Алданского улуса (района)"},
                {"name": "муниципального образования «Хоринский 1-й наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Хоринский наслег» Усть-Алданского улуса (района)"},
                {"name": "«Оспехский 1-й наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Легойский 2-й наслег»  Усть-Алданского улуса (района) "},
                {"name": "МО «Борогонский наслег» Усть – Алданский улуса (района)"},
                {"name": "МО «Берт-Усовский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Ольтехский наслег» Усть-Алданского улуса (района)"},
                {"name": "«Баягантайский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Бярийинский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Чериктейский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Оспехский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Курбусахский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Онерский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Мюрюнский наслег» Усть-Алданского улуса (района)»"},
                {"name": "МО «Легойский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Батагайский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Тюляхский наслег» Усть-Алданского улуса (района)"},
                {"name": "МО «Байагантайский 2-й наслег» Усть-Алданского улуса (района)"}
            ]
        },
        {
            "name": "Усть-Майский район",
            "regions": [
                {"name": "Муниципальный район «Усть-Майский улус (район)»"},
                {"name": "МО «Поселок Звездочка» Усть-Майского улуса (района)"},
                {"name": "«Поселок Югоренок» Усть-Майского улуса (района)"},
                {"name": "МО «Эжанский национальный наслег» Усть-Майского улуса (района)"},
                {"name": "МО «Поселок Усть-Мая» Усть-Майского улуса (района)"},
                {"name": "МО сельское поселение «Село Усть-Миль»"},
                {"name": "МО «Поселок Эльдикан» Усть-Майского улуса (района)"},
                {"name": "МО «Поселок Солнечный» Усть-Майского улуса (района)"},
                {"name": "МО « Петропавловский национальный наслег» Усть-Майского улуса (района)"},
                {"name": "МО сельское поселение «Кюпский национальный наслег» Усть – Майского улуса (района)"},
                {"name": "МО сельское поселение «Село Белькачи» Усть-Майского улуса (района)"}
            ]
        },
        {
            "name": "Усть-Янского район",
            "regions": [
                {"name": "МО «Усть-Янский улус (район)»"},
                {"name": "МО «Казачинский национальный наслег» Усть-Янского улуса (района)"},
                {"name": "МО «Омолойский национальный наслег» Усть-Янского улуса (района)"},
                {"name": "МО «Поселок Нижнеянск» Усть-Янского улуса (района)"},
                {"name": "городское поселение «поселок Депутатский» Усть-Янского улуса (района)"},
                {"name": "МО «Поселок Усть-Куйга» Усть-Янского улуса (района)"},
                {"name": "МО «Силянняхский национальный наслег» Усть-Янского улуса (района)"},
                {"name": "МО «Туматский национальный наслег» Усть-Янского улуса (района)"},
                {"name": "МО «Усть-Янский национальный наслег» Усть-Янского улуса (района)"},
                {"name": "МО сельское поселение «Уяндинский эвенский национальный наслег» Усть-Янского улуса (района)"},
                {"name": "МО «Юкагирский национальный (кочевой) наслег» Усть-Янского улуса (района)"}
            ]
        },
        {
            "name": "Хангаласский район",
            "regions": [
                {"name": "Муниципальный район «Хангаласский улус»"},
                {"name": "МО «Тумульский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Иситский наслег « Хангаласского улуса (района)"},
                {"name": "МО «Мальжагарский 4-й наслег» Хангаласского улуса (района)"},
                {"name": "МО «Синский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Тит-Арынский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Город Покровск» Хангаласского улуса (района)"},
                {"name": "сельское поселение «Бестяхский наслег» муниципального района «Хангаласский улус»"},
                {"name": "МО «Октемский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Техтюрский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Жерский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Качикатский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Жемконский 2-й наслег» Хангаласского улуса (района)"},
                {"name": "МО «Немюгюнский наслег» Хангаласского улуса (района)"},
                {"name": "МО «Поселок Мохсоголлох» муниципального района «Хангаласский улус»"},
                {"name": "МО «Мальжагарский 2-й наслег» Хангаласского улуса (района)"},
                {"name": "МО «Мальжагарский 1-й наслег» Хангаласского улуса (района)"},
                {"name": "МО «Жемконский 1-й наслег»« Хангаласского улуса (района)"},
                {"name": "МО «Мальжагарский 5-й наслег» Хангаласского улуса"}
            ]
        },
        {
            "name": "Чурапчинский район",
            "regions": [
                {"name": "МО «Чурапчинский улус (район)»"},
                {"name": "МО «Арылахский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Телейский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Соловьевский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Хатылынский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Мугудайский наслег» Чурапчинского улуса (района)"},
                {"name": "«Чурапчинский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Болугурский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Болтогинский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Ожулунский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Алагарский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Бахсытский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Хадарский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Сыланский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Кытанахский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Чакырский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Хоптогинский наслег» Чурапчинского улуса (района)"},
                {"name": "МО «Хаяхсытский наслег» Чурапчинского улуса (района)"}
            ]
        },
        {
            "name": "Эвено-Бытантайский район",
            "regions": [
                {"name": "МО «Эвено-Бытантайский национальный улус (район)»"},
                {"name": "МО «Тюгясирский наслег» Эвено-Бытантайского национального улуса (района)"},
                {"name": "«Верхне-Бытантайский наслег» Эвено-Бытантайского национального улуса (района)"},
                {"name": "МО «Нижне-Бытантайский наслег» Эвено-Бытантайского национального улуса (района)"}
            ]
        },
        {
            "name": "Жатай",
            "regions": [
                {"name": "МО Городской округ «Жатай»"}
            ]
        },
        {
            "name": "Якутск",
            "regions": [
                {"name": "городской округ «город Якутск»"}
            ]
        }
    ]

    CACHE_KEY_ALL = "all"

    _CACHE = {}

    @staticmethod
    def get_all():
        if Regions.CACHE_KEY_ALL not in Regions._CACHE:
            cache = []
            for row in Regions._rows:
                for region in row['regions']:
                    cache.append(region['name'])
            Regions._CACHE[Regions.CACHE_KEY_ALL] = cache
        return Regions._CACHE[Regions.CACHE_KEY_ALL]

    @staticmethod
    def get_filtered(query):
        result = []
        for row in Regions.get_all():
            if query.lower() in row.lower():
                result.append(row)
        return result

    @staticmethod
    def get_region_names():
        result = []
        for region in Regions._rows:
            result.append(region['name'])
        return result

    @staticmethod
    def get_by_region(name):
        result = []
        for region in list(filter(lambda r: r['name'] == name, Regions._rows))[0]['regions']:
            result.append(region['name'])
        return result
